Revit 2026 API

# GeometryCreationUtilitiesCreateRevolvedGeometry(Frame, IListCurveLoop, Double, Double, SolidOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid CreateRevolvedGeometry(
	Frame coordinateFrame,
	IList<CurveLoop> profileLoops,
	double startAngle,
	double endAngle,
	SolidOptions solidOptions
)
```
```vb
Public Shared Function CreateRevolvedGeometry (
	coordinateFrame As Frame,
	profileLoops As IList(Of CurveLoop),
	startAngle As Double,
	endAngle As Double,
	solidOptions As SolidOptions
) As Solid
```
```cpp
public:
static Solid^ CreateRevolvedGeometry(
	Frame^ coordinateFrame,
	IList<CurveLoop^>^ profileLoops,
	double startAngle,
	double endAngle,
	SolidOptions^ solidOptions
)
```
```fsharp
static member CreateRevolvedGeometry :
        coordinateFrame : Frame *
        profileLoops : IList<CurveLoop> *
        startAngle : float *
        endAngle : float *
        solidOptions : SolidOptions -> Solid
```

#### Parameters

coordinateFrame Frame

profileLoops IListCurveLoop

startAngle Double

endAngle Double

solidOptions SolidOptions

#### Return Value

Solid

#### Reference

GeometryCreationUtilities Class

CreateRevolvedGeometry Overload

Autodesk.Revit.DB Namespace